package example;

public class Note {
	public static void main(String[] args) {
		//단항 연산자 : 피연산자의 갯수가 1개인 연산자
				// => + : 양수화 연산자 - 피연산자의 +1 를 곱한 결과값을 제공하는 연산자
				// => - : 음수화 연산자(2의 보수 연산자) - 피연산자의 -1 를 곱한 결과값을 제공하는 연산자
				// => ~ : Bit Not 연산자 - 피연산자(정수값)의 Bit 단위의 값을 반대로 변환하여 제공하는 연산자
				// => ! : Not 연산자 - 피연산자(논리값)를 반대로 변환하여 제공하는 연산자
				// => (중요)++ : 1 증가 연산자 - 피연산자(정수변수)를 반드시 변수로 사용하여 변수값을 1 증가하여 저장하는 연산자
				// => -- : 1 감소 연산자 - 피연산자(정수변수)를 반드시 변수로 사용하여 변수값을 1 감소하여 저장하는 연산자
				// => (중요)(자료형) : 강제 형변환 연산자 - 피연산자의 자료형을 일시적으로 변환하여 제공하는 연산자
				// => (중요) new : 객체 생성 연산자 - 클래스의 생성자를 호출하여 객체를 생성하여 제공하는 연산자
		System.out.println("===================================");
	}
}
